; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_1 ?v2 - type_1 ?v8 - type_2)
 	      (pred_3 ?v1 - object ?v8 - type_2)
	      (pred_2 ?v2 - type_1 ?v7 - type_3)
	      (pred_4 ?v2 - type_1 ?v1 - object ?v7 - type_3))

   (:action op_1
       :parameters  (?v2 - type_1 ?v3 ?v6 - type_2)
       :precondition (and  (pred_1 ?v2 ?v3))
       :effect (and  (pred_1 ?v2 ?v6)
		     (not (pred_1 ?v2 ?v3))))

   (:action op_2
       :parameters (?v2 - type_1 ?v5 - object ?v4 - type_2 ?v7 - type_3)
       :precondition  (and  (pred_3 ?v5 ?v4) (pred_1 ?v2 ?v4) (pred_2 ?v2 ?v7))
       :effect (and (pred_4 ?v2 ?v5 ?v7)
		    (not (pred_3 ?v5 ?v4)) 
		    (not (pred_2 ?v2 ?v7))))

   (:action op_3
       :parameters (?v2 - type_1 ?v5 - object ?v4 - type_2 ?v7 - type_3)
       :precondition  (and  (pred_4 ?v2 ?v5 ?v7) (pred_1 ?v2 ?v4))
       :effect (and (pred_3 ?v5 ?v4)
		    (pred_2 ?v2 ?v7)
		    (not (pred_4 ?v2 ?v5 ?v7)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_04 obj_10 - type_1
obj_05 obj_02 obj_09 obj_08 - type_3
obj_11 obj_01 obj_07 obj_14 - type_2
obj_12 obj_06 obj_13 obj_03 - object)
(:init
(pred_1 obj_04 obj_11)
(pred_2 obj_04 obj_05)
(pred_2 obj_04 obj_02)
(pred_1 obj_10 obj_14)
(pred_2 obj_10 obj_09)
(pred_2 obj_10 obj_08)
(pred_3 obj_12 obj_14)
(pred_3 obj_06 obj_11)
(pred_3 obj_13 obj_01)
(pred_3 obj_03 obj_07)
)
(:goal
(and
(pred_3 obj_12 obj_07)
(pred_3 obj_06 obj_11)
(pred_3 obj_13 obj_01)
(pred_3 obj_03 obj_01)
)
)

(:constraints
  (always (not (pred_1 obj_04 obj_07)))
)
)

; plan
1. (op_2 obj_10 obj_12 obj_14 obj_08)
   deleted: (pred_3 obj_12 obj_14) (pred_2 obj_10 obj_08)
   added: (pred_4 obj_10 obj_12 obj_08)
   goals met: 2 of 4
2. (op_1 obj_04 obj_11 obj_01)
   deleted: (pred_1 obj_04 obj_11)
   added: (pred_1 obj_04 obj_01)
   goals met: 2 of 4
3. (op_1 obj_10 obj_14 obj_07)
   deleted: (pred_1 obj_10 obj_14)
   added: (pred_1 obj_10 obj_07)
   goals met: 2 of 4
4. (op_3 obj_10 obj_12 obj_07 obj_08)
   deleted: (pred_4 obj_10 obj_12 obj_08)
   added: (pred_3 obj_12 obj_07) (pred_2 obj_10 obj_08)
   goals met: 3 of 4
5. (op_2 obj_10 obj_03 obj_07 obj_09)
   deleted: (pred_3 obj_03 obj_07) (pred_2 obj_10 obj_09)
   added: (pred_4 obj_10 obj_03 obj_09)
   goals met: 3 of 4
6. (op_1 obj_10 obj_07 obj_01)
   deleted: (pred_1 obj_10 obj_07)
   added: (pred_1 obj_10 obj_01)
   goals met: 3 of 4
7. (op_3 obj_10 obj_03 obj_01 obj_09)
   deleted: (pred_4 obj_10 obj_03 obj_09)
   added: (pred_3 obj_03 obj_01) (pred_2 obj_10 obj_09)
   goals met: 4 of 4
